; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared0 - mode
	image1 - mode
	thermograph2 - mode
	GroundStation2 - direction
	Star3 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	Planet5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 149)
	(= (data Planet5 infrared0) 266)
	(= (data Star6 infrared0) 133)
	(= (data Phenomenon7 infrared0) 254)
	(= (data Phenomenon8 infrared0) 252)
	(= (data Phenomenon9 infrared0) 233)
	(= (data Planet5 image1) 274)
	(= (data Star6 image1) 25)
	(= (data Phenomenon7 image1) 126)
	(= (data Phenomenon8 image1) 49)
	(= (data Phenomenon9 image1) 201)
	(= (data Planet5 thermograph2) 279)
	(= (data Star6 thermograph2) 82)
	(= (data Phenomenon7 thermograph2) 236)
	(= (data Phenomenon8 thermograph2) 70)
	(= (data Phenomenon9 thermograph2) 116)
	(= (slew_time GroundStation2 GroundStation0) 48.19)
	(= (slew_time GroundStation0 GroundStation2) 48.19)
	(= (slew_time GroundStation2 GroundStation1) 6.89)
	(= (slew_time GroundStation1 GroundStation2) 6.89)
	(= (slew_time Star3 GroundStation0) 14.4)
	(= (slew_time GroundStation0 Star3) 14.4)
	(= (slew_time Star3 GroundStation1) 49.09)
	(= (slew_time GroundStation1 Star3) 49.09)
	(= (slew_time Star3 GroundStation2) 26.75)
	(= (slew_time GroundStation2 Star3) 26.75)
	(= (slew_time GroundStation1 GroundStation0) 4.341)
	(= (slew_time GroundStation0 GroundStation1) 4.341)
	(= (slew_time GroundStation4 GroundStation0) 58.5)
	(= (slew_time GroundStation0 GroundStation4) 58.5)
	(= (slew_time GroundStation4 GroundStation1) 3.722)
	(= (slew_time GroundStation1 GroundStation4) 3.722)
	(= (slew_time GroundStation4 GroundStation2) 29.98)
	(= (slew_time GroundStation2 GroundStation4) 29.98)
	(= (slew_time GroundStation4 Star3) 34.45)
	(= (slew_time Star3 GroundStation4) 34.45)
	(= (slew_time Planet5 GroundStation0) 79.37)
	(= (slew_time GroundStation0 Planet5) 79.37)
	(= (slew_time Planet5 GroundStation1) 3.223)
	(= (slew_time GroundStation1 Planet5) 3.223)
	(= (slew_time Planet5 GroundStation2) 2.844)
	(= (slew_time GroundStation2 Planet5) 2.844)
	(= (slew_time Planet5 Star3) 35.6)
	(= (slew_time Star3 Planet5) 35.6)
	(= (slew_time Planet5 GroundStation4) 28.45)
	(= (slew_time GroundStation4 Planet5) 28.45)
	(= (slew_time Star6 GroundStation0) 51.74)
	(= (slew_time GroundStation0 Star6) 51.74)
	(= (slew_time Star6 GroundStation1) 40.33)
	(= (slew_time GroundStation1 Star6) 40.33)
	(= (slew_time Star6 GroundStation2) 6.955)
	(= (slew_time GroundStation2 Star6) 6.955)
	(= (slew_time Star6 Star3) 13.48)
	(= (slew_time Star3 Star6) 13.48)
	(= (slew_time Star6 GroundStation4) 19.66)
	(= (slew_time GroundStation4 Star6) 19.66)
	(= (slew_time Star6 Planet5) 35.99)
	(= (slew_time Planet5 Star6) 35.99)
	(= (slew_time Phenomenon7 GroundStation0) 24.83)
	(= (slew_time GroundStation0 Phenomenon7) 24.83)
	(= (slew_time Phenomenon7 GroundStation1) 57.71)
	(= (slew_time GroundStation1 Phenomenon7) 57.71)
	(= (slew_time Phenomenon7 GroundStation2) 22.75)
	(= (slew_time GroundStation2 Phenomenon7) 22.75)
	(= (slew_time Phenomenon7 Star3) 5.789)
	(= (slew_time Star3 Phenomenon7) 5.789)
	(= (slew_time Phenomenon7 GroundStation4) 18.34)
	(= (slew_time GroundStation4 Phenomenon7) 18.34)
	(= (slew_time Phenomenon7 Planet5) 33.99)
	(= (slew_time Planet5 Phenomenon7) 33.99)
	(= (slew_time Phenomenon7 Star6) 60.18)
	(= (slew_time Star6 Phenomenon7) 60.18)
	(= (slew_time Phenomenon8 GroundStation0) 40.93)
	(= (slew_time GroundStation0 Phenomenon8) 40.93)
	(= (slew_time Phenomenon8 GroundStation1) 2.679)
	(= (slew_time GroundStation1 Phenomenon8) 2.679)
	(= (slew_time Phenomenon8 GroundStation2) 60.16)
	(= (slew_time GroundStation2 Phenomenon8) 60.16)
	(= (slew_time Phenomenon8 Star3) 18.24)
	(= (slew_time Star3 Phenomenon8) 18.24)
	(= (slew_time Phenomenon8 GroundStation4) 41.37)
	(= (slew_time GroundStation4 Phenomenon8) 41.37)
	(= (slew_time Phenomenon8 Planet5) 71.27)
	(= (slew_time Planet5 Phenomenon8) 71.27)
	(= (slew_time Phenomenon8 Star6) 32.16)
	(= (slew_time Star6 Phenomenon8) 32.16)
	(= (slew_time Phenomenon8 Phenomenon7) 98.18)
	(= (slew_time Phenomenon7 Phenomenon8) 98.18)
	(= (slew_time Phenomenon9 GroundStation0) 13.55)
	(= (slew_time GroundStation0 Phenomenon9) 13.55)
	(= (slew_time Phenomenon9 GroundStation1) 0.3703)
	(= (slew_time GroundStation1 Phenomenon9) 0.3703)
	(= (slew_time Phenomenon9 GroundStation2) 49.57)
	(= (slew_time GroundStation2 Phenomenon9) 49.57)
	(= (slew_time Phenomenon9 Star3) 29.73)
	(= (slew_time Star3 Phenomenon9) 29.73)
	(= (slew_time Phenomenon9 GroundStation4) 1.265)
	(= (slew_time GroundStation4 Phenomenon9) 1.265)
	(= (slew_time Phenomenon9 Planet5) 0.8276)
	(= (slew_time Planet5 Phenomenon9) 0.8276)
	(= (slew_time Phenomenon9 Star6) 17.33)
	(= (slew_time Star6 Phenomenon9) 17.33)
	(= (slew_time Phenomenon9 Phenomenon7) 21.31)
	(= (slew_time Phenomenon7 Phenomenon9) 21.31)
	(= (slew_time Phenomenon9 Phenomenon8) 36.87)
	(= (slew_time Phenomenon8 Phenomenon9) 36.87)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Planet5 image1)
	(have_image Star6 infrared0)
	(have_image Phenomenon7 thermograph2)
	(have_image Phenomenon8 thermograph2)
	(have_image Phenomenon9 thermograph2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 planet5 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 149 to 113.4, (fuel-used) from 0 to 35.6
   goals met: 0 of 5
2. (turn_to satellite0 groundstation4 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation4)
   changed: (fuel satellite0) from 113.4 to 84.95, (fuel-used) from 35.6 to 64.05
   goals met: 0 of 5
3. (turn_to satellite0 planet5 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 84.95 to 56.5, (fuel-used) from 64.05 to 92.5
   goals met: 0 of 5
4. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
5. (turn_to satellite0 groundstation1 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 56.5 to 53.277, (fuel-used) from 92.5 to 95.723
   goals met: 0 of 5
6. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 5
7. (turn_to satellite0 planet5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 53.277 to 50.054, (fuel-used) from 95.723 to 98.946
   goals met: 0 of 5
8. (take_image satellite0 planet5 instrument0 image1)
   added: (have_image planet5 image1)
   changed: (data_capacity satellite0) from 1000 to 726, (data-stored) from 0 to 274
   goals met: 1 of 5
9. (turn_to satellite0 groundstation1 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 50.054 to 46.831, (fuel-used) from 98.946 to 102.169
   goals met: 1 of 5
10. (turn_to satellite0 phenomenon8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 46.831 to 44.152, (fuel-used) from 102.169 to 104.848
   goals met: 1 of 5
11. (take_image satellite0 phenomenon8 instrument0 thermograph2)
   added: (have_image phenomenon8 thermograph2)
   changed: (data_capacity satellite0) from 726 to 656, (data-stored) from 274 to 344
   goals met: 2 of 5
12. (turn_to satellite0 groundstation1 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 44.152 to 41.473, (fuel-used) from 104.848 to 107.527
   goals met: 2 of 5
13. (turn_to satellite0 phenomenon9 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon9)
   changed: (fuel satellite0) from 41.473 to 41.1027, (fuel-used) from 107.527 to 107.897
   goals met: 2 of 5
14. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 2 of 5
15. (turn_to satellite0 groundstation1 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 41.1027 to 40.7324, (fuel-used) from 107.897 to 108.268
   goals met: 2 of 5
16. (turn_to satellite0 phenomenon9 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon9)
   changed: (fuel satellite0) from 40.7324 to 40.3621, (fuel-used) from 108.268 to 108.638
   goals met: 2 of 5
17. (turn_to satellite0 groundstation1 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 40.3621 to 39.9918, (fuel-used) from 108.638 to 109.008
   goals met: 2 of 5
18. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 5
19. (turn_to satellite0 groundstation0 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 39.9918 to 35.6508, (fuel-used) from 109.008 to 113.349
   goals met: 2 of 5
20. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 2 of 5
21. (turn_to satellite0 groundstation1 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 35.6508 to 31.3098, (fuel-used) from 113.349 to 117.69
   goals met: 2 of 5
22. (turn_to satellite0 phenomenon9 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon9)
   changed: (fuel satellite0) from 31.3098 to 30.9395, (fuel-used) from 117.69 to 118.06
   goals met: 2 of 5
23. (take_image satellite0 phenomenon9 instrument1 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   changed: (data_capacity satellite0) from 656 to 540, (data-stored) from 344 to 460
   goals met: 3 of 5
24. (turn_to satellite0 planet5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 30.9395 to 30.1119, (fuel-used) from 118.06 to 118.888
   goals met: 3 of 5
25. (turn_to satellite0 groundstation2 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 30.1119 to 27.2679, (fuel-used) from 118.888 to 121.732
   goals met: 3 of 5
26. (turn_to satellite0 star6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 27.2679 to 20.3129, (fuel-used) from 121.732 to 128.687
   goals met: 3 of 5
27. (take_image satellite0 star6 instrument1 infrared0)
   added: (have_image star6 infrared0)
   changed: (data_capacity satellite0) from 540 to 407, (data-stored) from 460 to 593
   goals met: 4 of 5
28. (turn_to satellite0 star3 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 20.3129 to 6.8329, (fuel-used) from 128.687 to 142.167
   goals met: 4 of 5
29. (turn_to satellite0 phenomenon7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 6.8329 to 1.0439, (fuel-used) from 142.167 to 147.956
   goals met: 4 of 5
30. (take_image satellite0 phenomenon7 instrument1 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   changed: (data_capacity satellite0) from 407 to 171, (data-stored) from 593 to 829
   goals met: 5 of 5
